clc
%Задание 1
A1 = [6 -1 -1; 1 -2 3; 3 4 4];
b1 = [0; 1; -1];
x1 = inv(A1)*b1;
check1 = A1 * x1 - b1;
fprintf('Задание 1.\n');
fprintf('Определитель матрицы: %.2f\n', det(A1));
fprintf('Вектор решения:');
fprintf('\t%.2f', x1);
fprintf('\nПроверка:');
fprintf('\t%.1f\t', check1);
fprintf('\nРешение с помощью linsolve:');
fprintf('\t%.2f', linsolve(A1, b1));
fprintf('\nРанг матрицы и норма коэффициентов:');
fprintf('\t%.2f', rank(A1), norm(A1));
fprintf('\nЧисло обусловленности матрицы:');
fprintf('\t%.2f', cond(A1));

%Задание 2
A2=[2 -1 -3 0; 1 -1 2 0; 3 -2 1 -1; -1 3 -1 1];
b2=[-9; 8; -5; 9];
x2=A2\b2;
check2 = A2*x2 - b2;
fprintf('\n\nЗадание 2.\n');
fprintf('Определитель матрицы: %.2f\n', det(A2));
fprintf('Вектор решения:');
fprintf('\t%.2f', x2);
fprintf('\nПроверка:');
fprintf('\t%.1f\t', check2);
fprintf('\nРешение с помощью linsolve:');
fprintf('\t%.2f', linsolve(A2, b2));
fprintf('\nРанг матрицы и норма коэффициентов:');
fprintf('\t%.2f', rank(A2), norm(A2));
fprintf('\nЧисло обусловленности матрицы:');
fprintf('\t%.2f', cond(A2));

%Задание 3
A3 = [2.34 -1.42 -0.54 0.21; 1.44 -0.53 1.43 -1.27; 0.63 -1.32 -0.65 1.43; 0.56 0.88 -0.67 -2.38];
b3 = [0.66; -1.44; 0.94; 0.73];
[L1, U] = lu(A3);
y3 = L1\b3;
x3 = U\y3;
check3 = A3*x3-b3;
fprintf('\n\nЗадание 3.\n');
fprintf('Определитель матрицы: %.2f\n', det(A3));
fprintf('Вектор решения:');
fprintf('\t%.2f', x3);
fprintf('\nПроверка:');
fprintf('\t%.1f\t', check3);
fprintf('\nРешение с помощью linsolve:');
fprintf('\t%.2f', linsolve(A3, b3));
fprintf('\nРанг матрицы и норма коэффициентов:');
fprintf('\t%.2f', rank(A3), norm(A3));
fprintf('\nЧисло обусловленности матрицы:');
fprintf('\t%.2f', cond(A3));

%Задание 4
fprintf('\n\nЗадание 4.\n');
M = [2, 1, 3, 0, 0, 0;
    0, 0, 3, 1, 1, 0;
    1, 0, 3, 0, 1, 0;
    0, 0, 1, 2, 0, 0;
    0, 1, 2, 0, 0, 0;
    0, 0, 1, 0, 0, 1;
    0, 0, 6, 0, 2, 1];
R = rank(M);
%disp(rank(M));
M(5,:) = [];
M(6,:) = [];
M(:,1) = [];
D = det(M); %а - детерминант невырожденной матрицы
B11 = 1;
B12 = 0;
B21 = 0;
B22 = 1;

sB1 = [1, 0, 0, 0, 0;
    0, 0, 1, 0, 0;
    3, 1, 2, 1, 6;
    0, 2, 0, 0, 0;
    1, 0, 0, 0,2;
    0, 0, 0, 1, 1];
%sB1 - матрица коэффициентов первой системы линейных уравнений

reshB1 = [-2; -1; -3; 0; 0; 0];
%reshB1 - матрица свободных коэффициентов первой системы линейных уравнений

B1 = sB1 \ reshB1;
%B1 - решение первой СЛАУ

sB2 = [1, 0, 0, 0, 0;
    0, 0, 1, 0, 0;
    3, 1, 2, 1, 6;
    1, 0, 0, 0, 2;
    0, 0, 0, 1, 1];
%sB2 - матрица коэффициентов второй системы линейных уравнений

reshB2 = [0; 0; -3; -1; 0];
%reshB2 - матрица свободных коэффициентов второй СЛАУ

B2 = sB2 \ reshB2;
%B2 - решение второй СЛАУ

fprintf('Детерминант невырожденной подматрицы: %2f\n\n', D);
fprintf('Вектор решения первой матрицы:');
fprintf('\t%.2f', B1);
fprintf('\nВектор решения второй матрицы:');
fprintf('\t%.2f', B2);
fprintf('\t%.2f', cond(M));